ec2-galera/galera-replicate/add_2_1080.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            176260
        write:                           62950
        other:                           25180
        total:                           264390
    transactions:                        12590  (11.66 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 239210 (221.47 per sec.)
    other operations:                    25180  (23.31 per sec.)

Test execution summary:
    total time:                          1080.1111s
    total number of events:              12590
    total time taken by event execution: 2160.0122
    per-request statistics:
         min:                                 20.36ms
         avg:                                171.57ms
         max:                                634.79ms
         approx.  95 percentile:             302.89ms

Threads fairness:
    events (avg/stddev):           6295.0000/19.00
    execution time (avg/stddev):   1080.0061/0.03